In [38]:
import numpy as np
import pandas as pd
from datetime import datetime

In [39]:
companies = ['GOOG,APPL,AMZN', 'JPM,BAC,GS']

In [40]:
c = pd.Series(companies)

In [41]:
c.str.split(',', expand = True)

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [42]:
messy_names = pd.Series(['ali   ', 'bo;bo', "  veli  "])
messy_names

0      ali
1       bo;bo
2      veli
dtype: object

In [43]:
# Method 1
messy_names.str.replace(';','').str.strip().str.capitalize()

0     Ali
1    Bobo
2    Veli
dtype: object

In [44]:
# Method 2
def clean_up(name):
    
    name = name.replace(';', '')
    name = name.strip()
    name = name.capitalize()
    
    return name

In [45]:
messy_names.apply(clean_up)

0     Ali
1    Bobo
2    Veli
dtype: object

In [46]:
ser = pd.Series(['Nov 3 1990', '2000-01-01', None])

In [47]:
ts = pd.to_datetime(ser)

In [48]:
ts

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [50]:
sales = pd.read_csv('C:\\Users\\Alican\\03-Python Data Science Bootcamp\\sales.csv')

In [54]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [56]:
sales['DATE'] = pd.to_datetime(sales['DATE'])
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [57]:
sales = pd.read_csv('C:\\Users\\Alican\\03-Python Data Science Bootcamp\\sales.csv', parse_dates = [0]) # Automatically parses indexed column. Same operation as above.

In [59]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [64]:
sales = sales.set_index('DATE')

KeyError: "None of ['DATE'] are in the columns"

In [71]:
sales.resample(rule = 'A').mean() # We can think of it as groupby of timestamp objects.

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000